app/controllers/students_controller.rb

  def section
    @class_section = params[:section]
    students_all = Student.all
---
SELECT "students".* FROM "students"